#include<iostream>
/* 
    Узнать значение i-го бита числа,
    используя сдвиг, но без маски.
    Поменять i-бит и j-бит местами.
 */
int main(){
    unsigned int x = 7;
    unsigned int a = x, b = x;
// 7 = 00000111
// 3 = 00000011
// 4 = 00000100
// 8 = 00001000

    int i; //i - номер искомого бита
    std::cout<<"i = ";
    std::cin>>i;
    
    a = a >> (i-1); // сдвигаем i-бит в начало
    a = a << 31; // сдвигаем влево, пока не останется i-бит
    a = a >> 31; // сдвигаем i-бит в начало
    

    std::cout<<"x = "<<a;
    a = a<<(i-1);

    // меняем биты i и j местами
    // костыль безумный, но работает
    int j;
    std::cout<<"\nj = ";
    std::cin>>j;

    b = b >> (j-1);
    b = b << 31;
    b = b >> 31;

    std::cout<<"x = "<<b;
    b = b <<(j-1);

    x = x ^ a;
    x = x ^ b;
    b = b >> (j-1);
    b = b << (i-1);
    a = a >>(i - 1);
    a = a << (j-1);
    x = x|a;
    x = x|b;

    std::cout<<"\nx1 = "<<x;
}
